{
    "title": "portfolio",
    "header": "Jeonghu's portfolio",
    "name": "Jeonghu Kim",
    "about" : "-About me",
    "about.bd" : "birthday: 7th Jun, 2002",
    "about.experience" : "experience",
    "skills": "-Skills",
    "skills.p1": "Basic skills: HTML, CSS, JS, TS, Node.js",
    "skills.p2": "Basic knowledges: python, MySQL, Git&GitHub",

    "resume": "resume",

    "story.title": "-story",

    "story.subtitle2": "RaspberryPi",
    "story.subtitle2.p1": "2018, a second years of highschool, I knew about RaspberryPi, a computer for educating and I bought it. At first, I though it is normal computer, but it wasn't. It didn't have monitor, even OS was not installed, so I should have to install Linux and to set settings by my self. Through the trial and error with entering commands, I've learned more about how computers acturally works and got more interested in computer and how it works. ",

    "story.subtitle3": "First project: Raspberry Pi server, 2019",
    "story.subtitle3.p1": "After I got the RaspberryPi, I didn't know what should I have to do with it. I'd searched on the internet how to use a RaspberryPi and I found a post which said I can use it for making server. So at the next, I searched what is required for making server. I've learnd HTML and CSS to make web pages and have learned Node.js for run the actual server for the web pages. Actually, since I had no idea what acutally I should make, so I didn't ran a server for a long time. But it was a good experience for the server that I made next time. ",

    "story.subtitle4": "Project 2: School community server, 2020",
    "story.subtitle4.p1": "While chatting with friends at a group chat, I felt group chat doesn't have enough function, so I should make a server for community. ",
    "story.subtitle4.p2": "With using Express, framework of Node.js, I made a server for bulletin board and used MySQL as well, which is a database, so that we can save posts and reply on the posts. ",
    "story.subtitle4.p3": "Even I added many function such like login, updating and deleting posts, functions of the server was too poor and after graduating highschool, friends rarely used the server so I stopped it. ",
    "story.subtitle5": "Project 3: notification program with using python, 2021",
    "story.subtitle5.p1": "When I using application of theater site, I felt uncomfortable that there's no notification for new timetable of movies, which makes defficult to book seats I want. So what I did is making a notification program with using python, API of the theater site and API of telegram. With running the program that I coded, I could get seats that I wanted and felt it was useful. Following is an attachment of a rink of the code. ",
    "story.subtitle6": "Project 4: web portfolio, 2022-present",
    "story.subtitle6.p1": "I try to get internship with programing job, which helps me improve programing skills. So I made this portfolio to show my skills and I'm keep updating it. I'm looking for your contact. "
}